package com.ncores.plaluvs.domain.boumanData.bad;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@Getter
@NoArgsConstructor
@AllArgsConstructor
public enum DRPWBad {
    //피부 건조 유발
    미리스타미도프로필베타인("미리스타미도프로필베타인")
    ,미리스타민옥사이드("미리스타민옥사이드")
    ,미리스틸알코올("미리스틸알코올")
    ,바바수아미도프로필베타인("바바수아미도프로필베타인")
    ,베헤닐베타인("베헤닐베타인")
    ,세테아릴알코올("세테아릴알코올")
    ,세틸베타인("세틸베타인")
    ,세틸알코올("세틸알코올")
    ,소듐데실설페이트("소듐데실페이트")
    ,소듐라우로암포아세테이트("소듐라우로암포아세테이트")
    ,소듐코코암포아세테이트("소듐코코암포아세테이트")
    ,소듐코코암포프로피오네이트("소듐코코암포프로피오네이트")
    ,소듐코코일하이드롤라이즈드밀단백질글루타메이트("소듐코코일하이드롤라이즈드밀단백질글루타메이트")
    ,소듐탈로우에이트("소듐탈로우에이트")
    ,소듐피이지올리브오일카복실레이트("소듐피이지-7올리브오일카복실레이트")
    ,소듐피이지코카마이드설페이트("소듐피이지-4코카마이드설페이트")
    ,소이아미도프로필아민옥사이드("소이아미도프로필아민옥사이드")
    ,스테아라마이드에이엠피("스테아라마이드에이엠피")
    ,스테아라마이드엠이에이("스테아라마이드엠이에이")
    ,스테아라민옥사이드("스테아라민옥사이드")
    ,스테아릴알코올("스테아릴알코올")
    ,올레아마이드미파("올레아마이드미파")
    ,올레아미도프로필베타인("올레아미도프로필베타인")
    ,올레아민옥사이드("올레아민옥사이드")
    ,올레일베타인("올레일베타인")
    ,카르니틴("카르니틴")
    ,코카마이드미파("코카마이드미파")
    ,코카마이드엠이에이("코카마이드엠이에이")
    ,코카미노프로피오닉애씨드("코카미노프로피오닉애씨드")
    ,코카미도프로필베타인("코카미도프로필베타인")
    ,코카미도프로필베타인아마이드엠이에이클로라이드("코카미도프로필베타인아마이드엠이에이클로라이드")
    ,코카미도프로필아민옥사이드("코카미도프로필아민옥사이드")
    ,코카미도프로필하이드록시설테인("코카미도프로필하이드록시설테인")
    ,코카민옥사이드("코카민옥사이드")
    ,코코넛알코올("코코넛알코올")
    ,코코베타인("코코-베타인")
    ,쿼터늄("쿼터늄-92")
    ,탈로우아마이드엠이에이("탈로우아마이드엠이에이")
    ,피이지스테아라민("피이지-2스테아라민")
    ,피이지올레아민("피이지-2올레아민")
    ,피이지코카마이드("피이지-3코카마이드")
    ,피이지하이드로제네이티드탈로우아민("피이지-2하이드로제네이티드탈로우아민")
    ,아몬드아미도프로필아민옥사이드("아몬드아미도프로필아민옥사이드");

    private String name;

}
