package com.ncores.plaluvs.domain.boumanData.bad;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@Getter
@AllArgsConstructor
@NoArgsConstructor
public enum OSPTBad {
    //여드름 증가 (여드름이 있는 경우)
    부틸스테아레이트("부틸스테아레이트")
    ,육계잎오일("육계잎오일")
    ,육계전초오일("육계전초오일")
    ,코코넛야자오일("코코넛야자오일")
    ,데실올리에이트("데실올리에이트")
    ,아이소세틸스테아레이트("아이소세틸스테아레이트")
    ,아이소프로필아이소스테아레이트("아이소프로필아이소스테아레이트")
    ,아이소프로필미리스테이트("아이소프로필미리스테이트")
    ,아이소프로필팔미테이트("아이소프로필팔미테이트")
    ,아이소스테아릴네오펜타노에이트("아이소스테아릴네오펜타노에이트")
    ,라놀린("라놀린")
    ,미리스틸미리스테이트("미리스틸미리스테이트")
    ,미리스틸프로피오네이트("미리스틸프로피오네이트")
    ,페퍼민트오일("페퍼민트오일")


    //문제를 일으키는 방부제
    ,벤잘코늄클로라이드("벤잘코늄클로라이드")
    ,p클로로m크레졸("p-클로로-m-크레졸")
    ,클로헥시딘("클로헥시딘")
    ,디아졸리디닐우레아("디아졸리디닐우레아")
    ,페녹시에탄올("페녹시에탄올")
    ,디엠디엠하이단토인("디엠디엠하이단토인")
    ,이미다졸리디닐우레아("이미다졸리디닐우레아")
    ,메틸파라벤("메틸파라벤")
    ,부틸파라벤("부틸파라벤")
    ,소듐메틸파라벤("소듐메틸파라벤")
    ,소듐부틸파라벤("소듐부틸파라벤")
    ,소듐에틸파라벤("소듐에틸파라벤")
    ,소듐아이소부틸파라벤("소듐아이소부틸파라벤")
    ,소듐프로필파라벤("소듐프로필파라벤")
    ,에틸파라벤("에틸파라벤")
    ,아이소부틸파라벤("아이소부틸파라벤")
    ,아이소프로필파라벤("아이소프로필파라벤")
    ,프로필파라벤("프로필파라벤")
    ,포타슘메틸파라벤("포타슘메틸파라벤")
    ,포타슘부틸파라벤("포타슘부틸파라벤")
    ,포타슘에틸파라벤("포타슘에틸파라벤")
    ,포타슘파라벤("포타슘파라벤")
    ,포타슘프로필파라벤("포타슘프로필파라벤")
    ,소듐아이소프로필파라벤("소듐아이소프로필파라벤")
    ,소듐파라벤("소듐파라벤")
    ,아이소데실파라벤("아이소데실파라벤")
    ,벤질파라벤("벤질파라벤")
    ,페녹시에틸파라벤("페녹시에틸파라벤")
    ,칼슘파라벤("칼슘파라벤")
    ,헥사미딘다이파라벤("헥사미딘다이파라벤")
    ,헥사미딘파라벤("헥사미딘파라벤")
    ,운데실레노일피이지5파라벤("운데실레노일피이지-5파라벤")
    ,페닐머큐릭아세테이트("페닐머큐릭아세테이트")
    ,쿼터늄15("쿼터늄-15")
    ,소르빅애씨드("소르빅애씨드")
    ,티메로살("티메로살")
    ,트리클로산("트리클로산");



    private  String name;
}
