package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@Getter
@NoArgsConstructor
@AllArgsConstructor
public enum DRNWGood {
    //수화/보습 효과
뷰글추출물("뷰글추출물")
,덱스판테놀("덱스판테놀")
,다이메티콘("다이메티콘")
,달맞이꽃오일("달맞이꽃오일")
,보리지씨오일("보리지씨오일")
,글리세린("글리세린")
,카놀라오일("카놀라오일")
,퀸즈랜드넛오일("퀸즈랜드넛오일")
,콜레스테롤("콜레스테롤")
,올리브오일("올리브오일")
,잇꽃씨오일("잇꽃씨오일")
,콜로이달오트밀("콜로이달오트밀")
,시어버터("시어버터")

    //주름 개선
,락틱애씨드("락틱애씨드")
,시트릭애씨드("시트릭애씨드")
,파이틱애씨드("파이틱애씨드")
,글루코노락톤("글루코노락톤")
,레티놀("레티놀")

    //주름 예방
,바질추출물("바질추출물")
,인삼("인삼")
,홍삼("홍삼")
,카페인("카페인")
,포도씨추출물("포도씨추출물")
,녹차("녹차")
,당근추출물("당근추출물")
,라이코펜("라이코펜")
,유비퀴논("유비퀴논")
,피톨("피톨")
,석류추출물("석류추출물")
,커큐민("커큐민")
,페룰릭애씨드("페룰릭애씨드")
,소나무껍질추출물("소나무껍질추출물")
,구주소나무껍질추출물("구주소나무껍질추출물")
,라디아타소나무껍질추출물("라디아타소나무껍질추출물")
,흰소나무껍질추출물("흰소나")
,리기다소나무껍질추출물("리기다소나무껍질추출물")
,올레오일소나무껍질추출물("올레오일소나무껍질추출물")
,프랑스해안송껍질추출물("프라스해안송껍질추출물")
,피버퓨추출물("피버퓨추출물")
,로즈마리("로즈마리")
,제니스테인("제니스테인")
,생강("생강");



    private String name;
}
