package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum DRPTGood {
//검은반점 개선
 알부틴("알부틴")
,코직애씨드("코직애씨드")
,검은뽕나무열매추출물("검은뽕나무열매추출물")
,뽕나무열매추출물("뽕나무열매추출물")
,꾸지뽕나무열매추출물("꾸지뽕나무열매추출물")
,코코넛야자열매즙("코코넛야자열매즙")
,나이아신아마이드("나이아신아마이드")
,오이추출물("오이추출물")
,레조시놀("레조시놀")
,분홍바늘꽃추출물("분홍바늘꽃추출물")
,레티놀("레티놀")
,갈릭애씨드("갈릭애씨드")
,살리실릭애씨드("살리실릭애씨드")
,감초뿌리추출물("감초뿌리추출물")
,바위취추출물("바위취추출물")
,아스코빅애씨드("아스코빅애씨드")
    //보습/수분 제공
,뷰글추출물("뷰굴추출물")
,달맞이꽃오일("달맞이꽃오일")
,보리지씨오일("보리지씨오일")
,카놀라오일("카놀라오일")
,라놀린("라놀린")
,퀸즈랜드넛오일("퀸즈랜드넛오일")
,콜레스테롤("콜레스테롤")
,올리브오일("올리브오일")
,글리세린("글리세린")
,로즈힙씨오일("로즈힙씨오일")
,콜로이달오트밀("콜로이달오트밀")
,잇꽃씨오일("잇꽃씨오일")
,덱스판테놀("덱스판테놀")
,시어버터("시어버터")
,다이메티콘("다이메티콘");


    private String name;
}
