package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@Getter
@NoArgsConstructor
@AllArgsConstructor
public enum DSNTGood {
//염증 예방
마트리카리아추출물("마트리카리아추출물")
,콜로이달오트밀("콜로이달오트밀")
,오이("오이")
,덱스판테놀("덱스판테놀")
,분홍바늘꽃추출물("분홍바늘꽃추출물")
,달맞이꽃오일("달맞이꽃오일")
,피버퓨추출물("피버퓨추출물")
,들깨잎추출물("들깨잎추출물")
,소나무껍질추출물("소나무껍질추출물")
,구주소나무껍질추출물("구주소나무껍질추출물")
,라디아타소나무껍질추출물("라디아타소나무껍질추출물")
,흰소나무껍질추출물("흰소나무껍질추출물")
,리기다소나무껍질추출물("리기다소나무껍질추출물")
,올레오일소나무껍질추출물("올레오일소나무껍질추출물")
,프랑스해안송껍질추출물("프랑스해안송껍질추출물")
,홍조류추출물("홍조류추출물")
,타임추출물("타임추출물")
,붉은토끼풀추출물("붉은토끼풀추출물")

    // 잡티 개선
,알부틴("알부틴")
,오이추출물("오이추출물")
,오이열매추출물("오이열매추출물")
,감초뿌리추출물("감초뿌리추출물")
,창과감초뿌리추출물("창과감초뿌리추출물")
,스페인감초뿌리추출물("스페인감초뿌리추출물")
    //잡티 방지
,코코넛야자열매추출물("코코넛야자열매추출물")
,나이아신아마이드("나이아신아마이드")
,바위취추출물("바위취추출물")
,콩("콩")
,돌콩("돌콩")

    //피부 수분 공급
,보리지씨오일("보리지씨오일")
,피마자씨오일("피마자씨오일")
,콜레스테롤("콜레스테롤")
,다이메티콘("다이메티콘")
,글리세린("글리세린")
,올리브오일("올리브오일")
,당호박씨오일("당호바가씨오일")
,잇꽃씨오일("잇꽃씨오일")
,해바라기씨오일("해바라기씨오일");

    private String name;

}
