package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum ORPTGood {

    //검은반점 개선
    알부틴("알부틴")
    ,코직애씨드("코직애씨드")
    ,검은뽕나무열매추출물("검은뽕나무열매추출물")
    ,뽕나무열매추출물("뽕나무열매추출물")
    ,꾸지뽕나무열매추출물("꾸지뽕나무열매추출물")
    ,코코넛야자열매즙("코코넛야자열매즙")
    ,나이아신아마이드("나이아신아마이드")
    ,오이추출물("오이추출물")
    ,레조시놀("레조시놀")
    ,분홍바늘꽃추출물("분홍바늘꽃추출물")
    ,레티놀("레티놀")
    ,갈릭애씨드("갈릭애씨드")
    ,살리실릭애씨드("살리실릭애씨드")
    ,감초뿌리추출물("감초뿌리추출물")
    ,바위취추출물("바위취추출물")
    ,아스코빅애씨드("아스코빅애씨드")

    //피부 재생 촉진
    ,시트릭애씨드("시트릭애씨드")
    ,글라이콜릭애씨드("클라이콜릭애씨드")
    ,락틱애씨드("락틱애씨드")
    ,파이틱애씨드("파이틱애씨드");


    private String name;
}
