package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum ORPWGood {
    //검은반점 개선
    알부틴("알부틴")
    ,코직애씨드("코직애씨드")
    ,검은뽕나무열매추출물("검은뽕나무열매추출물")
    ,뽕나무열매추출물("뽕나무열매추출물")
    ,꾸지뽕나무열매추출물("꾸지뽕나무열매추출물")
    ,코코넛야자열매즙("코코넛야자열매즙")
    ,나이아신아마이드("나이아신아마이드")
    ,오이추출물("오이추출물")
    ,레조시놀("레조시놀")
    ,분홍바늘꽃추출물("분홍바늘꽃추출물")
    ,레티놀("레티놀")
    ,갈릭애씨드("갈릭애씨드")
    ,살리실릭애씨드("살리실릭애씨드")
    ,감초뿌리추출물("감초뿌리추출물")
    ,바위취추출물("바위취추출물")
    ,아스코빅애씨드("아스코빅애씨드")

    //주름 개선
    ,글라이콜릭애씨드("글라이콜릭애씨드")
    ,락틱애씨드("락틱애씨드")

    //주름 예방
    ,바질추출물("바질추출물")
    ,인삼("인삼")
    ,홍삼("홍삼")
    ,카페인("카페인")
    ,포도씨추출물("포도씨추출물")
    ,녹차("녹차")
    ,당근추출물("당근추출물")
    ,라이코펜("라이코펜")
    ,유비퀴논("유비퀴논")
    ,피톨("피톨")
    ,석류추출물("석류추출물")
    ,커큐민("커큐민")
    ,페룰릭애씨드("페룰릭애씨드")
    ,로즈마리("로즈마리")
    ,제니스테인("제니스테인")
    ,생강("생강");


    private String name;
}
