package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum OSNWGood {

    //염증 예방
    마트리카리아추출물("마트리카리아추출물")
    ,콜로이달오트밀("콜로이달오트밀")
    ,오이("오이")
    ,덱스판테놀("덱스판테놀")
    ,분홍바늘꽃추출물("분홍바늘꽃추출물")
    ,달맞이꽃오일("달맞이꽃오일")
    ,피버퓨추출물("피버퓨추출물")
    ,들깨잎추출물("들깨잎추출물")
    ,소나무껍질추출물("소나무껍질추출물")
    ,구주소나무껍질추출물("구주소나무껍질추출물")
    ,라디아타소나무껍질추출물("라디아타소나무껍질추출물")
    ,흰소나무껍질추출물("흰소나무껍질추출물")
    ,리기다소나무껍질추출물("리기다소나무껍질추출물")
    ,올레오일소나무껍질추출물("올레오일소나무껍질추출물")
    ,프랑스해안송껍질추출물("프랑스해안송껍질추출물")
    ,홍조류추출물("홍조류추출물")
    ,타임추출물("타임추출물")
    ,붉은토끼풀추출물("붉은토끼풀추출물")

    //주름 예방
    ,바질추출물("바질추출물")
    ,인삼("인삼")
    ,홍삼("홍삼")
    ,카페인("카페인")
    ,포도씨추출물("포도씨추출물")
    ,녹차("녹차")
    ,당근추출물("당근추출물")
    ,라이코펜("라이코펜")
    ,유비퀴논("유비퀴논")
    ,피톨("피톨")
    ,석류추출물("석류추출물")
    ,커큐민("커큐민")
    ,페룰릭애씨드("페룰릭애씨드")
    ,로즈마리("로즈마리")
    ,제니스테인("제니스테인")
    ,생강("생강")

    //여드름 개선
    ,살리실릭애씨드("살리실릭애씨드")
    ,티트리잎오일("티트리잎오일");


    private String name;

}
