package com.ncores.plaluvs.domain.boumanData.good;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum OSPWGood {
    //검은반점 개선
    알부틴("알부틴")
    ,코직애씨드("코직애씨드")
    ,검은뽕나무열매추출물("검은뽕나무열매추출물")
    ,뽕나무열매추출물("뽕나무열매추출물")
    ,꾸지뽕나무열매추출물("꾸지뽕나무열매추출물")
    ,코코넛야자열매즙("코코넛야자열매즙")
    ,나이아신아마이드("나이아신아마이드")
    ,오이추출물("오이추출물")
    ,레조시놀("레조시놀")
    ,분홍바늘꽃추출물("분홍바늘꽃추출물")
    ,레티놀("레티놀")
    ,갈릭애씨드("갈릭애씨드")
    ,살리실릭애씨드("살리실릭애씨드")
    ,감초뿌리추출물("감초뿌리추출물")
    ,바위취추출물("바위취추출물")
    ,아스코빅애씨드("아스코빅애씨드")
    //여드름 개선
    ,티트리잎오일("티트리잎오일")

    //염증예방
    ,마트리카리아추출물("마트리카리아추출물")
    ,오이("오이")
    ,피버퓨추출물("피버퓨추출물")
    ,들깨잎추출물("들깨잎추출물")
    ,소나무껍질추출물("소나무껍질추출물")
    ,구주소나무껍질추출물("구주소나무껍질추출물")
    ,라디아타소나무껍질추출물("라디아타소나무껍질추출물")
    ,흰소나무껍질추출물("흰소나무껍질추출물")
    ,리기다소나무껍질추출물("리기다소나무껍질추출물")
    ,올레오일소나무껍질추출물("올레오일소나무껍질추출물")
    ,프랑스해안송껍질추출물("프랑스해안송껍질추출물")
    ,홍조류추출물("홍조류추출물")
    ,타임추출물("타임추출물")
    ,붉은토끼풀추출물("붉은토끼풀추출물");

    private String name;

}
